[{
        "id": "authentication",
        "title": {
            "en": "Authentication",
            "fr": "Authentification"
        },
        "description": {
            "en": "verification of the identity of a user, process or device, often as a prerequisite to allowing access to resources in an information system",
            "fr": "vérification de l'identité d'un utilisateur, d'un processus ou d'un dispositif, souvent comme condition préalable à l'accès aux ressources d'un système d'information"
        },
        "detail": {
            "en": "<p>Authentication is verifying the identity of a user, process, or device, often as a prerequisite to allowing access to resources in an information system or, stated another way, authentication is how the identity of a subject trying to access a resource is verified. In the digital domain, this is done by verifying that the subject attempting to access a resource is in possession of an authenticator that is associated with the subject's credential and that the credential is valid. In the future, other elements may play a role in the authentication process (e.g., user behavioral patterns).</p><p>As with identities and credentials, there are four levels of assurance associated with the authentication process as defined in the Guideline on Defining Authentication Requirements. Additional information is also provided in <a href=\"https://www.cyber.gc.ca/en/guidance/user-authentication-guidance-information-technology-systems-itsp30031-v3\" target=\"_blank\"><em>User Authentication Guidance for Information Technology Systems (ITSP.30.031v3)</em></a>.</p><p>Note that authentication is one of several elements that are used to support access control decisions.  As the GC moves towards the implementation of a Zero Trust security model, access control decisions are expected to be based on multiple considerations such as authentication, entitlements/roles, device status, environmental considerations, behavioral patterns, real-time threat assessment, policy constraints, target resource, etc.</p>",
            "fr": ""
        }
    },
    {
        "id": "authorization",
        "title": {
            "en": "Authorization",
            "fr": "Autorisation"
        },
        "description": {
            "en": "the process of determining whether or not an authenticated entity has permission to access a particular resource",
            "fr": "le processus permettant de déterminer si une entité authentifiée est autorisée à accéder à une ressource particulière"
        },
        "detail": {
            "en": "<p>Authorization is the process of determining whether or not an authenticated entity has permission to access a particular resource.  Authorization is typically based on static permissions assigned to the subject or dynamic rules governing the overall system.</p><p>Authorization is typically based on one (or more) of four models:<ul><li>Access Control Lists (ACLs)</li><li>Role-Based Access Control (RBAC)</li><li>Policy-Based Access Control (PBAC)</li><li>Attribute-Based Access Control (ABAC)</li></ul></p><p>Note that these models are not necessarily mutually exclusive.  For example, Gartner recommends a combination of RBAC and ABAC to meet the complex requirements typically associated with implementing authorization solutions.</p><p>The eXtensible Access Control Markup Language (XACML) specification describes a comprehensive ABAC model that consists of a number of components including Policy Enforcement Points (PEP) which control access to resources (servers, applications, data); and one or more Policy Decision Points (PDP) which render “authorization decisions” based on requests originating from the PEPs. In today's digital service delivery environment, authorization decisions are typically made locally (i.e., each application is responsible for making authorization decisions for their own resources) so the PEP and PDP tend to be co-located in practice.  However, the XACML model also makes it possible to centralize authorization decisions in much the same way that authentication is being centralized through federation (see Section 3.2.1 in document) which allows for greater flexibility in the future.  In addition, a JSON profile has been defined which provides a simpler, RESTful method for implementing the XACML requests/responses between PEPs and PDPs. Furthermore, the US National Institute of Standards and Technology (NIST) <a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-207.pdf\" target=\"_blank\"><em>Zero Trust Architecture publication</em></a> (NIST SP 800-207) embraces the XACML model and this is something the GC is investigating as part of its Zero Trust security initiative.</p>",
            "fr": ""
        }
    },
    {
        "id": "privileged-access",
        "title": {
            "en": "Privileged Access Management",
            "fr": "Gestion des privilèges d'accès"
        },
        "description": {
            "en": "a specialized area of ICAM that deals specifically with the protection of privileged accounts",
            "fr": "un domaine spécialisé de la Gestion des accès et des justificatifs d'identité (GIJIA) qui traite spécifiquement de la protection des comptes privilégiés"
        },
        "detail": {
            "en": "<p>Privileged Access Management (PAM) is a specialized area of ICAM that deals specifically with the protection of privileged accounts. Threat actors tend to target privileged user accounts since it gives them access to escalated privileges that non-privileged users do not have.  Therefore, additional security controls to protect privileged user accounts are essential in order to help mitigate the risks associated with unauthorized access to accounts with elevated privileges.</p><p>According to Gartner, PAM consists of the following core capabilities:<ul><li>Discovery of privileged accounts across multiple systems, infrastructure and applications</li><li>Credential management for privileged accounts</li><li>Delegation of access to privileged accounts</li><li>Session establishment, management, monitoring and recording for interactive privileged access</li><li>Controlled elevation of commands</li></ul></p><p>Additional considerations include the principle of least privilege, separation of duties, two-person control and just-in-time access.</p>",
            "fr": ""
        }
    },
    {
        "id": "policy-repository",
        "title": {
            "en": "Policy Repository",
            "fr": "Répertoire des politiques"
        },
        "description": {
            "en": "a data repository or system that stores the rules/policies that define which attributes a requester must have in order to access a particular resource",
            "fr": "un entrepôt de données ou un système qui stocke les règles/politiques qui définissent les attributs qu'un demandeur doit avoir pour accéder à une ressource en particulier"
        },
        "detail": {
            "en": "<p>To provide secure, timely control and access to all resources, accurate, reliable and timely information about resources, users and devices is required. Pairing this information results in the creation of rules/policies that define which attributes a requester must have in order to access a particular resource. The policy repository stores these rules/policies, which, in the simplest cases could be simply access control lists (ACLs) or role assignments for RBAC, but in more complex systems, such as those based on ABAC, consist of dynamically-processed rules for access control.</p>",
            "fr": ""
        }
    },
    {
        "id": "physical-and",
        "title": {
            "en": "Physical and Logical Access Control Systems",
            "fr": "Systèmes de contrôle d'accès logiques et physiques"
        },
        "description": {
            "en": "a Physical Access Control System deals with controlling access to physical facilities and a Logical Access Control system controls an entity's ability to access system and information resources",
            "fr": "un système de contrôle d'accès physique permet de contrôler l'accès aux installations physiques et un système de contrôle d'accès logique contrôle la capacité d'une entité d'accéder au système et aux ressources d'information"
        },
        "detail": {
            "en": "<p>A comprehensive ICAM system must address both logical and physical access control.</p><p>A Physical Access Control System (PACS) deals with controlling access to facilities such as an office building as well as restricting access to sensitive areas within a facility such as a room that houses IT assets.  Physical access control can be implemented in a variety of ways including building access cards, physical keys, biometrics, voice recognition and/or electronic keypad locks.</p><p>A Logical Access Control System (LACS) is \"an automated system that controls an individual's ability to access one or more computer system resources such as a workstation, network, application, or database. A logical access control system requires validation of an individual's identity through some mechanism such as a personal identification number (PIN), card, biometric, or other authenticator. It has the capability to assign different access privileges to different persons depending on their roles and responsibilities in an organization.\"</p><p>Ideally, PACS and LACS would be fully integrated with shared attributes in order to support security operations that combine physical and logical access. This could include support for geo-gating or the ability to disable both physical and logical access simultaneously.</p>",
            "fr": ""
        }
    },
    {
        "id": "consent-management",
        "title": {
            "en": "Consent Management",
            "fr": "Gestion du consentement"
        },
        "description": {
            "en": "provides users control over how their personal information is collected, used, retained, and disclosed",
            "fr": "permet aux utilisateurs de contrôler la façon dont leurs renseignements personnels sont recueillis, utilisés, conservés et divulgués"
        },
        "detail": {
            "en": "<p>Consent management gives users control over how their personal information is collected, used, retained, and disclosed. It includes user notice, consent, revocation of consent, and opt-out options which are implemented by design and made clear to users. It is guided by compliance to privacy legislation such as the <a href=\"https://laws-lois.justice.gc.ca/ENG/ACTS/P-21/FullText.html\" target=\"_blank\"><em>Privacy Act</em></a> and Part I of the <a href=\"https://laws-lois.justice.gc.ca/ENG/ACTS/P-8.6/index.html\" target=\"_blank\"><em>Personal Information Protection and Electronic Documents Act</em></a> (PIPEDA).</p><p>In the future, OAuth 2.0 could be used by the GC to support consent management through delegated authorization.</p>",
            "fr": ""
        }
    },
    {
        "id": "e-signature",
        "title": {
            "en": "e-Signature",
            "fr": "Signature électronique"
        },
        "description": {
            "en": "an electronic representation of a individual's signature that links that person to an electronic document or transaction and provides evidence of that person's intent to approve or to be legally bound by its contents",
            "fr": "une représentation électronique de la signature d'une personne qui lie cette personne à un document ou à une transaction électronique et qui fournit une preuve de l'intention de cette personne d'approuver ou d'être légalement liée par son contenu"
        },
        "detail": {
            "en": "<p>In support of conducting business electronically, electronic signatures permit users to meet the requirements for a signature in digital form. This can be for many different related purposes such as expressing consent, approval, agreement, acceptance, or authorization of everyday business activities.</p><p>Note that e-Signatures can be implemented in a number of ways and at different levels of assurance.  Refer to the <a href=\"https://www.canada.ca/en/government/system/digital-government/online-security-privacy/government-canada-guidance-using-electronic-signatures.html\" target=\"_blank\"><em>Government of Canada Guidance on Using Electronic Signatures</em></a> for additional information.</p>",
            "fr": ""
        }
    }
]