[{
        "id": "credential-service",
        "title": {
            "en": "Credential Service Providers",
            "fr": "Fournisseurs de services de justificatifs d’identité"
        },
        "description": {
            "en": "a trusted entity that issues or registers subscriber authenticators and issues electronic credentials to subscribers",
            "fr": "une entité de confiance qui établisse ou enregistre des authentificateurs d’abonnés et émet des justificatifs d’identité électronique aux abonnés"
        },
        "detail": {
            "en": "<p>A Credential Service Provider (CSP) is a “trusted entity that issues or registers subscriber authenticators and issues electronic credentials to subscribers. A CSP may be an independent third party, or may issue credentials for its own use.” Note that the credential issued by the CSP binds the identity of the subscriber to the associated authenticator. CSPs are responsible for the life cycle management of these credentials/authenticators over time (see Section 3.1.2.3 in the document).</p><p>For external requirements, the GC currently accepts several different sources of credentials including a number of financial institutions, provincially supplied credentials (currently Alberta and British Columbia only) and a GC branded credential known as GCKey. These credentials are supported by the external GC federation services and users are able to select their preferred credential to access GC on-line services. Although some departments continue to maintain their own legacy credentials, they are encouraged to transition to the GC external federation services wherever possible and all new deployments should include this as a mandatory requirement.</p><p>For internal requirements, there are a number of sources that provide credentials including the Internal Credential Management (ICM) Public Key Infrastructure (PKI), departmental PKIs, consolidated SSC and departmental Active Directories, and various other sources including those that are maintained by individual applications/services.</p><p>Note that PKI is a fundamental building block of a modern credential architecture. PKI can be used to establish and life cycle manage credentials for both users as well as NPEs such as devices and applications.  In addition, PKI can be used to support several security services such as binding an identity to a credential, encryption, digital signatures as well as authentication.</p><p>Furthermore, the GC has recently launched an internal federation service referred to as GCpass which is a centralized authentication/SSO broker that will also be capable of issuing credentials to internal users in the future as discussed under Section 3.2.1.1 in the document. Any existing or new enterprise applications/services should use the GCpass internal federation service.</p>",
            "fr": "<p>Un fournisseur de services de justificatifs (FSJ) est une « une entité de confiance qui [établit] ou enregistre des authentificateurs d’abonnés et émet des justificatifs d’identité électronique aux abonnés ». Un FSJ peut être un tiers indépendant, ou peut émettre des justificatifs d’identité pour son propre usage » . Veuillez prendre note que les justificatifs d’identité émis par le FSJ lient l’identité de l’abonné à l’authentificateur associé. Les FSJ sont responsables de la gestion du cycle de vie de ces justificatifs d’identité ou authentificateurs au fil du temps (voir la section 3.1.2.3).</p><p>Pour ce qui est des exigences externes, le GC accepte actuellement plusieurs sources différentes de justificatifs d’identité, dont un certain nombre d’institutions financières, des titres de compétence provinciaux (actuellement l’Alberta et la Colombie-Britannique seulement) et un justificatif d’identité du GC appelé CléGC. Ces justificatifs sont appuyés par les services externes de fédération du GC et les utilisateurs peuvent choisir leurs justificatifs d’identité préférés pour accéder aux services en ligne gouvernementaux. Bien que certains ministères continuent de conserver leurs propres justificatifs d’identité, ils sont encouragés à passer aux services de fédération externe du GC dans la mesure du possible et tous les nouveaux déploiements devraient inclure cette exigence obligatoire.</p><p>Pour ce qui est des besoins internes, il existe un certain nombre de sources qui fournissent des références, notamment l’infrastructure à clé publique (ICP) de la gestion des justificatifs internes (GJI), les ICP ministérielles, les référentiels ministériels actifs et regroupés de Services partagés Canada (SPC) et des ministères, et diverses autres sources, y compris celles qui sont gérées par des applications ou des services individuels.</p><p>Il est à noter que l’ICP est un élément fondamental d’une architecture moderne des justificatifs d’identité. L’ICP peut être utilisée pour établir et gérer le cycle de vie des justificatifs des utilisateurs et des entités qui ne sont pas des personnes, tels que les périphériques et les applications. En outre, l’ICP peut être utilisée pour prendre en charge plusieurs services de sécurité, tels que la liaison d’une identité à un justificatif d’identité, le chiffrement, les signatures numériques ainsi que l’authentification.</p><p>De plus, le GC a récemment lancé un service de fédération interne appelé GCpass, qui est un courtier d’authentification centralisée ou d’identification unique (IU) qui sera également en mesure d’émettre des justificatifs d’identité aux utilisateurs internes à l’avenir, comme il est indiqué à la section 3.2.1.1. Toute application ou service organisationnel existant ou nouveau doit utiliser le service de fédération interne GCpass.</p>"
        }
    },
    {
        "id": "credential-repositories",
        "title": {
            "en": "Credential Repositories",
            "fr": "Référentiels de justificatifs d’identité"
        },
        "description": {
            "en": "any data repository or system that stores credentials",
            "fr": "tout entrepôt de données ou système qui stocke des justificatifs d’identité"
        },
        "detail": {
            "en": "<p>Credential repositories are a fundamental building block of digital identity. Within credential management, they are often holders of primary credentials such as userid/password and are sometimes also a holder of other (secondary) authentication factors. Often credential repositories such as Active Directory also perform the authentication of users against the credentials stored within them. Note that repositories can store credentials, along with other attributes that play an important role in the identity management systems pillar.</p>",
            "fr": "<p>Les référentiels de justificatifs d’identité sont un élément fondamental de l’identité numérique. Dans le cadre de la gestion des justificatifs d’identité, ils sont souvent les titulaires des justificatifs principaux comme le numéro d’identification de l’utilisateur ou le mot de passe et sont parfois également titulaires d’autres facteurs d’authentification (secondaires). Souvent, les référentiels de justificatifs d’identité comme Active Directory effectuent également l’authentification des utilisateurs par rapport aux justificatifs d’identité qui y sont stockés. Veuillez prendre note que les référentiels peuvent stocker des justificatifs, ainsi que d’autres attributs qui jouent un rôle important dans le pilier des systèmes de gestion des identités.</p>"
        }
    },
    {
        "id": "credential-lifecycle",
        "title": {
            "en": "Credential Lifecycle Management",
            "fr": "Gestion du cycle de vie des justificatifs d’identité"
        },
        "description": {
            "en": "the creation, issuance and ongoing maintenance of credentials and authenticators",
            "fr": "la création, la délivrance et la maintenance continue des justificatifs d’identité et des authentificateurs"
        },
        "detail": {
            "en": "<p>Credential lifecycle management (for persons and NPEs) consists of:</p><ul><li>Creation, issuance - creation/activation of one or more credentials which bind the identity of the entity to the associated authenticator(s) and the assignment of those credential(s)/authenticator(s) to a specific entity</li><li>Recovery, reset - to handle loss or compromise of a credential (e.g., a user forgets their password)</li><li>Suspension, blocking, unblocking - temporary deactivation of a credential resulting from extended absence (for example, for long-term personal leave) or suspected compromise of a credential</li><li>Renewal, re-issuance, update - to maintain validity and accuracy of credentials over time</li><li>Revocation, removal, expiry, and destruction - permanent deactivation of a credential due to pre-established expiration, compromise, termination of employment, etc. Depending on the type of credential, it may be re-initialized and re-assigned to another user.</li></ul></p>",
            "fr": "<p>La gestion du cycle de vie des justificatifs d’identité (pour les personnes et les entités qui ne sont pas des personnes) est composée de ce qui suit :</p><ul><li>Création, émission – création et activation d’un ou de plusieurs justificatifs d’identité qui lient l’identité de l’entité à l’authentificateur(s) associé(s) et attribution de ces justificatifs ou authentificateur(s) à une entité spécifique.</li><li>Récupération, réinitialisation – pour gérer la perte ou le compromis d’un justificatif d’identité (p. ex., un utilisateur oublie son mot de passe).</li><li>Suspension, blocage, déblocage – désactivation temporaire d’un justificatif résultant d’une absence prolongée (p. ex., pour un congé personnel de longue durée) ou risque de compromettre un justificatif.</li><li>Renouvellement, nouvelle émission, mise à jour – pour maintenir la validité et l’exactitude des justificatifs dans le temps.</li><li>Révocation, retrait, expiration et destruction – désactivation permanente d’un justificatif en raison de l’expiration préétablie, d’une compromission ou d’une cessation d’emploi, entre autres. Selon le type de justificatif d’identité, il peut être réinitialisé et réaffecté à un autre utilisateur.</li></ul></p>"
        }
    }
]