[{
        "id": "credential-service",
        "title": {
            "en": "Credential Service Providers",
            "fr": "Fournisseurs de services de justificatifs d'identité"
        },
        "description": {
            "en": "a trusted entity that issues or registers subscriber authenticators and issues electronic credentials to subscribers",
            "fr": "une entité de confiance qui établisse ou enregistre des authentificateurs d'abonnés et émet des justificatifs d'identité électronique aux abonnés"
        },
        "detail": {
            "en": "<p>A Credential Service Provider (CSP) is a “trusted entity that issues or registers subscriber authenticators and issues electronic credentials to subscribers. A CSP may be an independent third party, or may issue credentials for its own use.” Note that the credential issued by the CSP binds the identity of the subscriber to the associated authenticator. CSPs are responsible for the life cycle management of these credentials/authenticators over time (see Section 3.1.2.3 in the document).</p><p>For external requirements, the GC currently accepts several different sources of credentials including a number of financial institutions, provincially supplied credentials (currently Alberta and British Columbia only) and a GC branded credential known as GCKey. These credentials are supported by the external GC federation services and users are able to select their preferred credential to access GC on-line services. Although some departments continue to maintain their own legacy credentials, they are encouraged to transition to the GC external federation services wherever possible and all new deployments should include this as a mandatory requirement.</p><p>For internal requirements, there are a number of sources that provide credentials including the Internal Credential Management (ICM) Public Key Infrastructure (PKI), departmental PKIs, consolidated SSC and departmental Active Directories, and various other sources including those that are maintained by individual applications/services.</p><p>Note that PKI is a fundamental building block of a modern credential architecture. PKI can be used to establish and life cycle manage credentials for both users as well as NPEs such as devices and applications.  In addition, PKI can be used to support several security services such as binding an identity to a credential, encryption, digital signatures as well as authentication.</p><p>Furthermore, the GC has recently launched an internal federation service referred to as GCpass which is a centralized authentication/SSO broker that will also be capable of issuing credentials to internal users in the future as discussed under Section 3.2.1.1 in the document. Any existing or new enterprise applications/services should use the GCpass internal federation service.</p>",
            "fr": ""
        }
    },
    {
        "id": "credential-repositories",
        "title": {
            "en": "Credential Repositories",
            "fr": "Référentiels de justificatifs d'identité"
        },
        "description": {
            "en": "any data repository or system that stores credentials",
            "fr": "tout entrepôt de données ou système qui stocke des justificatifs d'identité"
        },
        "detail": {
            "en": "<p>Credential repositories are a fundamental building block of digital identity. Within credential management, they are often holders of primary credentials such as userid/password and are sometimes also a holder of other (secondary) authentication factors. Often credential repositories such as Active Directory also perform the authentication of users against the credentials stored within them. Note that repositories can store credentials, along with other attributes that play an important role in the identity management systems pillar.</p>",
            "fr": ""
        }
    },
    {
        "id": "credential-lifecycle",
        "title": {
            "en": "Credential Lifecycle Management",
            "fr": "Gestion du cycle de vie des justificatifs d'identité"
        },
        "description": {
            "en": "the creation, issuance and ongoing maintenance of credentials and authenticators",
            "fr": "la création, la délivrance et la maintenance continue des justificatifs d'identité et des authentificateurs"
        },
        "detail": {
            "en": "<p>Credential lifecycle management (for persons and NPEs) consists of:</p><ul><li>Creation, issuance - creation/activation of one or more credentials which bind the identity of the entity to the associated authenticator(s) and the assignment of those credential(s)/authenticator(s) to a specific entity</li><li>Recovery, reset - to handle loss or compromise of a credential (e.g., a user forgets their password)</li><li>Suspension, blocking, unblocking - temporary deactivation of a credential resulting from extended absence (for example, for long-term personal leave) or suspected compromise of a credential</li><li>Renewal, re-issuance, update - to maintain validity and accuracy of credentials over time</li><li>Revocation, removal, expiry, and destruction - permanent deactivation of a credential due to pre-established expiration, compromise, termination of employment, etc. Depending on the type of credential, it may be re-initialized and re-assigned to another user.</li></ul></p>",
            "fr": ""
        }
    }
]