[{
        "id": "reporting-analytics",
        "title": "Reporting & Analytics",
        "description": "the process of organizing data into informational summaries in order to monitor how different ICAM components are performing and complying with policy",
        "detail": "<p>Reporting is \"the process of organizing data into informational summaries in order to monitor how different ICAM components are performing and complying with policy\". Analytics is \"the process of exploring data and reports in order to extract meaningful insights, which can be used to better understand the overall system and improve efficiency\".</p><p>Reporting and analytics span across many (if not all) ICAM systems including (but not limited to): application layer, data layer, presentation layer, as well as physical systems which interact with the ICAM components.</p><p>Examples of reporting and analytics are:<ul><li>Application/Platform Certification (Attestation)</li><li>Data/File Access Certification (Attestation)</li><li>Exception Reporting</li><li>Activity-Based Reporting</li><li>Role Certification (Attestation)</li></ul></p>"
    },
    {
        "id": "access-certification",
        "title": "Access Certification & Discovery",
        "description": "the process of validating access rights within systems",
        "detail": "<p>Access certification and discovery is the process of validating access rights within systems. This process is necessary for security risk management and effective governance. With access certification, organizations and regulations aim to formally validate users within systems and ensure their access rights are appropriate.</p>"
    },
    {
        "id": "approval-workflows",
        "title": "Approval Workflows",
        "description": "processes used to manage the life cycle of a digital identity including provisioning, on-going maintenance and de-provisioning of identity attributes",
        "detail": "<p>Approval workflows are used to manage the life cycle of a digital identity including provisioning, on-going maintenance and de-provisioning of identity attributes (e.g., name, privileges, roles). There can be, and typically are, more than one approval authority depending on the context. In addition, a single approval workflow can require multiple checks from a variety of stakeholders.</p><p>Approval workflows could:<ul><li>Be triggered automatically, for example when onboarding a new employee</li><li>Arise by user self-service request for access to a resource that requires separate approval</li><li>Be directly configured by an authorized authority (e.g., manager adding team members to a group)</li></ul></p>"
    },
    {
        "id": "policy-compliance",
        "title": "Policy and Compliance",
        "description": "processes used to ensure compliance to applicable organizational policies and legislation",
        "detail": "<p>Policy and compliance ensures adherence to the organization's policies and applicable laws. This enforcement can be done through a combination of automated and manual processes. Compliance can be further enhanced/evolved through mechanisms that are very formal, such as audits, to informal, such as peer reviews, which can happen on a periodic basis. Certain systems can have specific auditing requirements in order to maintain recognition/certification.</p><p>Types of policies could include:<ul><li>Privacy</li><li>Security</li><li>HR</li></ul></p><p>Policy and compliance includes remediation of any policy violations.</p>"
    },
    {
        "id": "monitoring-auditing",
        "title": "Monitoring, Auditing and Logging",
        "description": "processes and tools used to support ongoing evaluation and assessment that various information systems are operating properly and are being used as intended",
        "detail": "<p>An audit log is a chronological record of system activities, including records of system accesses and operations performed in a given period. Audit logs provide a record of important events that a given system (or collection of systems) has performed. This can be used to construct an audit trail to examine the sequence of activities surrounding or leading to a specific operation, procedure, or event in a security-relevant transaction to facilitate formal audits. Refer to <a href=\"https://www.canada.ca/en/government/system/digital-government/online-security-privacy/event-logging-guidance.html\" target=\"_blank\"><em>GC Event Logging Guidance</em></a> for further information.</p><p>Monitoring is an umbrella term that can include many facets of system evaluation. This is the process of collecting, aggregating and analyzing metrics to better evaluate the use of the system.</p><p>These components work together to ensure the system is healthy, running efficiently and are critical for detection and prevention of anomalies and threats.</p>"
    }
]